# Используем стабильную версию Node.js на базе легкого дистрибутива Alpine
FROM node:20-alpine

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы манифестов для установки зависимостей
# Это делается отдельно, чтобы Docker кэшировал слой с node_modules
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install --legacy-peer-deps

# Копируем все остальные файлы проекта
COPY . .

# Открываем порт, на котором обычно работает Vite/сервер
EXPOSE 5173

# Запускаем приложение
CMD ["npm", "run", "dev"]